app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    @task = Task.find_by(id:id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    id = params[:id]
    @task = Task.find_by(id:id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "description" = $2, "completion_date" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["name", "water balloons"], ["description", "134"], ["completion_date", "234"], ["updated_at", "2018-09-20 00:01:05.547253"], ["id", 10]]
---
  def update
    id = params[:id]
    @task = Task.find_by(id:id)
    @task.name = params[:task][:name]
    @task.description = params[:task][:description]
    @task.completion_date = params[:task][:completion_date]
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 12]]
---
  def destroy
    id = params[:id]
    @task = Task.find_by(id:params[:id].to_i)
    @task.destroy

INSERT INTO "tasks" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "adfjl"], ["created_at", "2018-09-20 00:27:45.037919"], ["updated_at", "2018-09-20 00:27:45.037919"]]
---
  def create
    @task = Task.new(name: params[:task][:name])
      if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", " "], ["updated_at", "2018-09-20 00:30:20.385852"], ["id", 10]]
---
  def status
    id = params[:id]
    @task = Task.find_by(id:id)
    if @task.status.class == String
      @task.status = nil
    else @task.status == nil
      @task.status = "Completed on #{Date.today}"
    end
      @task.save